buffer:
  size: 10000

simulation:
  n: 20
  guis:
    -

procedure:
  episode_length: 10
  batch_size: 256
  updates_per_sample: 1
  action_scaling:
    - 0.0
    - 0.0
    - 1.125
    - 0.0
  reward_scaling: 600
  test_conf_path: ${hydra:runtime.cwd}/../config/test_conf/default_at_2m.pkl
  screen:
    textures_path: /home/aecgroup/aecdata/Textures/mcgillManMade_600x600_png_selection/
    size: 1.5
    min_distance: 0.5
    max_distance: 5.0
    max_depth_speed: 0.0
    max_speed_in_deg: 0.0

experiment:
  n_episodes: 20000
  policy_every: 1
  policy_after: 1000
  critic_every: 1
  encoders_every: 1
  evaluate_every: 10
  test_every: 500
  test_at_start: True
  record_episode_every: 500
  save_every: 500
  final_recording: True

agent:
  policy_learning_rate: 1e-5
  critic_learning_rate: 1e-3
  encoder_learning_rate: 1e-3
  n_simulations: ${simulation.n}
  exploration:
    stddev: 0.5
    prob: 0.1
  scales:
    - name: fine
      resolution: 32
      view_angle: 9
    - name: coarse
      resolution: 32
      view_angle: 27
  pathways:
    - name: pavro
      joints:
        - vergence
        - cyclo
      encoder_model_arch:
        backend: tensorflow
        class_name: Sequential
        config:
          layers:
          - class_name: Conv2D
            config:
              activation: relu
              activity_regularizer: null
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              data_format: channels_last
              dilation_rate:
              - 1
              - 1
              dtype: float32
              filters: 96
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              kernel_size:
              - 8
              - 8
              name: conv2d_4
              padding: valid
              strides:
              - 4
              - 4
              trainable: true
              use_bias: true
          - class_name: Conv2D
            config:
              activation: relu
              activity_regularizer: null
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              data_format: channels_last
              dilation_rate:
                - 1
                - 1
              dtype: float32
              filters: 24
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              kernel_size:
              - 1
              - 1
              name: conv2d_5
              padding: valid
              strides:
              - 1
              - 1
              trainable: true
              use_bias: true
          name: sequential_1
        keras_version: 2.3.0-tf
      decoder_model_arch:
        backend: tensorflow
        class_name: Sequential
        config:
          layers:
          - class_name: Conv2D
            config:
              activation: linear
              activity_regularizer: null
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              data_format: channels_last
              dilation_rate:
              - 1
              - 1
              dtype: float32
              filters: ${decoder_out_size:${agent.pathways.0.encoder_model_arch.config.layers.0.config.kernel_size.0},${agent.pathways.0.encoder_model_arch.config.layers.0.config.kernel_size.1},6}
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              kernel_size:
              - 1
              - 1
              name: conv2d_6
              padding: valid
              strides:
              - 1
              - 1
              trainable: true
              use_bias: true
          name: sequential_2
        keras_version: 2.3.0-tf
      policy_model_arch:
        backend: tensorflow
        class_name: Sequential
        config:
          layers:
          - class_name: PolicyPerScaleConv2D
            config:
              activation: tanh
              filters: 64
              kernel_size:
              - 2
              - 2
              n_scales: 2
              padding: valid
              pool_padding: valid
              pool_size:
              - 2
              - 2
              pool_strides:
              - 2
              - 2
              strides:
              - 1
              - 1
          - class_name: Dense
            config:
              activation: tanh
              activity_regularizer: null
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              dtype: float32
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              name: dense_2
              trainable: true
              units: 2
              use_bias: true
          name: sequential_4
        keras_version: 2.3.0-tf
      critic_model_arch:
        backend: tensorflow
        class_name: Sequential
        config:
          layers:
          - class_name: CriticPerScaleConv2D
            config:
              activation: relu
              filters: 128
              kernel_size:
              - 2
              - 2
              n_scales: 2
              padding: valid
              pool_padding: valid
              pool_size:
              - 2
              - 2
              pool_strides:
              - 2
              - 2
              strides:
              - 1
              - 1
          - class_name: Dense
            config:
              activation: relu
              activity_regularizer: null
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              dtype: float32
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              name: dense
              trainable: true
              units: 400
              use_bias: true
          - class_name: Dense
            config:
              activation: linear
              activity_regularizer: null
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              dtype: float32
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              name: dense_1
              trainable: true
              units: 1
              use_bias: true
          name: sequential_3
        keras_version: 2.3.0-tf

    - name: magno
      joints:
        - tilt
        - pan
      encoder_model_arch:
        backend: tensorflow
        class_name: Sequential
        config:
          layers:
          - class_name: Conv2D
            config:
              activation: relu
              activity_regularizer: null
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              data_format: channels_last
              dilation_rate:
              - 1
              - 1
              dtype: float32
              filters: 192
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              kernel_size:
              - 8
              - 8
              name: conv2d_4
              padding: valid
              strides:
              - 4
              - 4
              trainable: true
              use_bias: true
          - class_name: Conv2D
            config:
              activation: relu
              activity_regularizer: null
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              data_format: channels_last
              dilation_rate:
              - 1
              - 1
              dtype: float32
              filters: 48
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              kernel_size:
              - 1
              - 1
              name: conv2d_5
              padding: valid
              strides:
              - 1
              - 1
              trainable: true
              use_bias: true
          name: sequential_1
        keras_version: 2.3.0-tf
      decoder_model_arch:
        backend: tensorflow
        class_name: Sequential
        config:
          layers:
          - class_name: Conv2D
            config:
              activation: linear
              activity_regularizer: null
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              data_format: channels_last
              dilation_rate:
              - 1
              - 1
              dtype: float32
              filters: ${decoder_out_size:${agent.pathways.1.encoder_model_arch.config.layers.0.config.kernel_size.0},${agent.pathways.1.encoder_model_arch.config.layers.0.config.kernel_size.1},12}
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              kernel_size:
              - 1
              - 1
              name: conv2d_6
              padding: valid
              strides:
              - 1
              - 1
              trainable: true
              use_bias: true
          name: sequential_2
        keras_version: 2.3.0-tf
      policy_model_arch:
        backend: tensorflow
        class_name: Sequential
        config:
          layers:
          - class_name: PolicyPerScaleConv2D
            config:
              activation: relu
              filters: 64
              kernel_size:
              - 2
              - 2
              n_scales: 2
              padding: valid
              pool_padding: valid
              pool_size:
              - 2
              - 2
              pool_strides:
              - 2
              - 2
              strides:
              - 1
              - 1
          - class_name: Dense
            config:
              activation: tanh
              activity_regularizer: null
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              dtype: float32
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              name: dense_2
              trainable: true
              units: 2
              use_bias: true
          name: sequential_4
        keras_version: 2.3.0-tf
      critic_model_arch:
        backend: tensorflow
        class_name: Sequential
        config:
          layers:
          - class_name: CriticPerScaleConv2D
            config:
              activation: relu
              filters: 256
              kernel_size:
              - 2
              - 2
              n_scales: 2
              padding: valid
              pool_padding: valid
              pool_size:
              - 2
              - 2
              pool_strides:
              - 2
              - 2
              strides:
              - 1
              - 1
          - class_name: Dense
            config:
              activation: relu
              activity_regularizer: null
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              dtype: float32
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              name: dense
              trainable: true
              units: 400
              use_bias: true
          - class_name: Dense
            config:
              activation: linear
              activity_regularizer: null
              bias_constraint: null
              bias_initializer:
                class_name: Zeros
                config: {}
              bias_regularizer: null
              dtype: float32
              kernel_constraint: null
              kernel_initializer:
                class_name: GlorotUniform
                config:
                  seed: null
              kernel_regularizer: null
              name: dense_1
              trainable: true
              units: 1
              use_bias: true
          name: sequential_3
        keras_version: 2.3.0-tf


hydra:
  run:
    dir: ../experiments/${now:%Y-%m-%d}/${now:%H-%M-%S}_${hydra.job.override_dirname}
  sweep:
    dir: ../experiments/${now:%Y-%m-%d}/${now:%H-%M-%S}/
    subdir: job${hydra.job.num}_${hydra.job.override_dirname}
  job:
    config:
      # configuration for the ${hydra.job.override_dirname} runtime variable
      override_dirname:
        kv_sep: '.'
        item_sep: '__'
        exclude_keys: []
